### Eksik Veriler

In [1]:
import pandas as pd
import numpy as np

In [6]:
SozlukVerisi={"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(SozlukVerisi)

In [7]:
havaDurumuDataFrame #eksik veriler içeren veri setimiz

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

#### nan değerleri silmeye bakalım işe yarar mı

In [8]:
havaDurumuDataFrame.dropna() # nan değerleri silme satırlarda nan olanı siler  orjinali bozmaz

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [9]:
havaDurumuDataFrame.dropna(axis=1)  # nan değerleri silme stunlarda nan olanı siler

   Izmir
0     40
1     39
2     38

In [12]:
SozlukVerisi2={"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
havaDurumuDataFrame2=pd.DataFrame(SozlukVerisi2)

In [13]:
havaDurumuDataFrame2

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

##### thresh ile kaç tane nan dan fazla olanları silmesi gerektiğini belirtebiliriz.

In [15]:
havaDurumuDataFrame2.dropna(axis=1,thresh=2) #2 nan dan fazla olanları silsin .

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

####  nan olan yerlere istenen değer atama

In [16]:
havaDurumuDataFrame2.fillna(20)   ## nan değerlere 20 ataması yaptık

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0